#### PipeFittingAndAccessoryData Members

---

|  |
| --- |
| PipeFittingAndAccessoryData Class   Methods   Properties   See Also |

The  PipeFittingAndAccessoryData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  PipeFittingAndAccessoryData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetAllConnectorData | Gets the connector data of the pipe fitting or pipe accessory. |
| Public method | GetEntity | Returns an Entity of the Schema of the serverGUID. |
| Public method | GetFamilyInstanceId | Gets the Id of the fiting or accessory instance |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BehaviorType | The behavior type of the pipe fitting or pipe accessory. |
| Public property | FluidDensity | The fluid density of the pipe fitting or pipe accessory, Units: (kg/ftÂ³). |
| Public property | FluidViscosity | The fluid dynamic viscosity of the pipe fitting or pipe accessory, Units: (kg/(ftÂ·s)). |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Origin | The origin position of the pipe fitting or pipe accessory. |
| Public property | PartType | The part type of the pipe fitting or pipe accessory. |
| Public property | ServerGUID | The GUID of the pipe fitting or pipe accessory. |
| Public property | SystemClassification | The system classification of the pipe fitting or pipe accessory. |

# See Also

PipeFittingAndAccessoryData Class

Autodesk.Revit.DB.Plumbing Namespace